#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/omshub/core-api/runs/run-DiBXNzMmc9ZATHhE

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_app.app-core-api will be created
  + resource "digitalocean_app" "app-core-api" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + id                   = (known after apply)
      + live_url             = (known after apply)
      + updated_at           = (known after apply)

      + spec {
          + domains = (known after apply)
          + name    = "core-api"
          + region  = "ams"

          + domain {
              + name     = (known after apply)
              + type     = (known after apply)
              + wildcard = (known after apply)
              + zone     = (known after apply)
            }

          + service {
              + environment_slug   = "docker"
              + http_port          = 1927
              + instance_count     = 1
              + instance_size_slug = "basic-xxs"
              + name               = "core-api"
              + run_command        = (known after apply)

              + github {
                  + branch         = "main"
                  + deploy_on_push = false
                  + repo           = "omshub/core-api"
                }

              + routes {
                  + path = "/"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @disposedtrolley, Action: `pull_request`*